/**
 * Напиши цикл for, який виводить у консоль браузера
 * числа за зростанням від a до b, але тільки якщо число кратне 5.
 */

/* const start = 13;
const end = 50;

for (let i = start; i <= end; i += 5) {
  if (i % 5 === 0) {
    console.log(i);
  }
} */

/*
 * Напиши скрипт, який підраховує суму всіх парних чисел,
 * які входять в діапазон чисел у змінних від min до max.
 * Наприклад, якщо min=0 и max=5, то діапазон 0-5, і в ньому два парних числа - 2 і 4, їх сума 6.
 */

/* const min = 0;
const max = 5;
let total = 0; //6

for (let i = min; i <= max; i++) {
  if (i % 2 === 0) {
    total += i;
  }
}

console.log(total); */

/* 
Напиши скрипт, який питатиме логін за допомогою `prompt` та логуватиме
результат у консоль браузера.

- Якщо відвідувач вводить ``Адмін``, то `prompt` запитує пароль
- Якщо нічого не введено або натиснуто клавішу Esc - вивести рядок ``Скасовано'`
- В іншому випадку вивести рядок "Я вас не знаю"

Пароль перевіряти так:

- Якщо введено пароль "Я адмін", то вивести рядок "Доброго дня!"
- Інакше виводити рядок "Неправильний пароль"
 */

/* 
Написати функцію яка приймає число та виводить таблицю множення для цього числа
*/

/* const login = prompt('Enter your login');

if (login === 'Admin') {
  const password = prompt('Enter your password');

  if (password === 'Я адмін') {
    console.log('Доброго дня!');
  } else {
    console.log('Неправильний пароль');
  }
} else if (login === '') {
  console.log('Canceled');
} else {
  console.log('Я вас не знаю');
} */
